[View in Colaboratory](https://colab.research.google.com/github/ditiansm2015/ML-algorithms-Implementation/blob/master/Logistic_Regression.ipynb)

In [0]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [343]:
df=pd.read_csv("https://raw.githubusercontent.com/Shreyas3108/Titanic-EDA-and-Survival-prediction/master/train.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [344]:
df.shape

(891, 12)

In [345]:
# will output to True if one or more of the values in the pandas Series is NaN, False if no.

df['Survived'].hasnans

False

In [346]:
# Checking total nul values in each column
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [0]:
check_null=df.isnull()

In [348]:
# Creating an array has_cabin to store 0(True i.e. NaN) and 1(False i.e. Not NaN) which would later be assigned to new column 
# "has_cabin" to show whether passengers have their own cabin or not
has_cabin=[]
  
for null_or_not in check_null["Cabin"]:
  if null_or_not==True:
    has_cabin.append(0)
  else:
    has_cabin.append(1)
    
    
df['has_cabin']=has_cabin
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,has_cabin
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0

In [349]:
# Replacing NaN value with mean value in Age column
df["Age"]=df["Age"].fillna(df["Age"].mean())
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,has_cabin
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0

In [350]:
df["Categorical_Age"]=pd.qcut(df["Age"], 4,labels=False)
df["Categorical_Age"].head()

0    0
1    3
2    1
3    2
4    2
Name: Categorical_Age, dtype: int64

In [351]:
df["Categorical_Fare"]=pd.qcut(df["Fare"], 4,labels=False)
df["Categorical_Fare"].head()

0    0
1    3
2    1
3    3
4    1
Name: Categorical_Fare, dtype: int64

In [352]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,has_cabin,Categorical_Age,Categorical_Fare
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,0,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,3,3
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,1,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1,2,3
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0,2,1

In [353]:
df.drop(['Cabin'], axis = 1, inplace = True)
df.drop(['Name'], axis = 1, inplace = True)
df.drop(['Ticket'], axis = 1, inplace = True)
df.drop(['PassengerId'], axis = 1, inplace = True)
df.drop(['Age'], axis = 1, inplace = True)
df.drop(['Fare'], axis = 1, inplace = True)
df.drop(['SibSp'], axis = 1, inplace = True)
df.drop(['Parch'], axis = 1, inplace = True)
df.head()

,Survived,Pclass,Sex,Embarked,has_cabin,Categorical_Age,Categorical_Fare
0,0,3,male,S,0,0,0
1,1,1,female,C,1,3,3
2,1,3,female,S,0,1,1
3,1,1,female,S,1,2,3
4,0,3,male,S,0,2,1

In [354]:
# using get_dummies()
# this gives a new dataframe containing Male and Female column only

dummy=pd.get_dummies(df['Sex'])
dummy.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [355]:
 # Merging new dataframe with original dataframe
  df=pd.concat([df,dummy],axis=1)
  df.head()

,Survived,Pclass,Sex,Embarked,has_cabin,Categorical_Age,Categorical_Fare,female,male
0,0,3,male,S,0,0,0,0,1
1,1,1,female,C,1,3,3,1,0
2,1,3,female,S,0,1,1,1,0
3,1,1,female,S,1,2,3,1,0
4,0,3,male,S,0,2,1,0,1

### using LabelEncoding 
### applying LabelEncoder to convert 'Sex' and 'Embarked' into numeric value
from sklearn.preprocessing import LabelEncoder
label_encoder = LabelEncoder()

df['Sex_encoded'] = label_encoder.fit_transform(df['Sex'])

df['Embarked_encoded'] = label_encoder.fit_transform(df['Embarked'].astype(str))

### Gives error here --->  df['Embarked_encoded'] = label_encoder.fit_transform(df['Embarked'])

df.head()

In [0]:
# importing LogisticRegression library
from sklearn.linear_model import LogisticRegression

In [0]:
reg=LogisticRegression()

In [0]:
# importing train_test_split to split the dataset into training set and test set
from sklearn.cross_validation import train_test_split

In [359]:
df.head()

,Survived,Pclass,Sex,Embarked,has_cabin,Categorical_Age,Categorical_Fare,female,male
0,0,3,male,S,0,0,0,0,1
1,1,1,female,C,1,3,3,1,0
2,1,3,female,S,0,1,1,1,0
3,1,1,female,S,1,2,3,1,0
4,0,3,male,S,0,2,1,0,1

In [0]:
# declaring 'Survived' as output variable
labels = df['Survived']

# declaring all the variables except 'Sex','Embarked' and 'Survived' as Features  
xtrain = df.drop(['Sex','Embarked','Survived'],axis=1)

In [0]:
# breaking dataset as test and train set
x_train , x_test , y_train , y_test = train_test_split(xtrain , labels , test_size = 0.30,random_state =1)

In [362]:
# fitting training set into model
reg.fit(x_train,y_train)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
          intercept_scaling=1, max_iter=100, multi_class='ovr', n_jobs=1,
          penalty='l2', random_state=None, solver='liblinear', tol=0.0001,
          verbose=0, warm_start=False)

In [363]:
reg.score(x_test,y_test)

0.7910447761194029